Scheme1/system/cuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

cuttingPlane
{
    type            surfaces;
    libs            ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   raw;
    writeFormat     ascii;
    fields          (p);

    interpolationScheme cellPoint;

    surfaces
    (
        upstream10dn
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (-1.245 0 0);
            normal          (1 0 0);
            interpolate     true;
        }
	upstream5dn
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (-0.6925 0 0);
            normal          (1 0 0);
            interpolate     true;
        }
	upstreamfati
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (-0.14 0 0);
            normal          (1 0 0);
            interpolate     true;
        }
        downstream10dn
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (1.245 0 0);
            normal          (1 0 0);
            interpolate     true;
        }

    );
}


// ************************************************************************* //
