Scheme1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    default cellMDLimited Gauss linear 0.5;
    grad(U) cellMDLimited Gauss linear 0.5;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(phi,U)      Gauss linearUpwind grad(U);	
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,k)      Gauss linearUpwind default;
    div(phi,omega)  Gauss linearUpwind default;
    div(phi,B)      Gauss limitedLinear 1;
    div(phi,B)      Gauss linearUpwind default;
    div(B)          Gauss linear;
    div(phi,nuTilda) Gauss limitedLinear 1;
    div(phi,nuTilda) Gauss linearUpwind default;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    default         Gauss linear limited 0.777;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
    default         limited 0.777; 
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
